Revit 2027 API
EnergyDataSettings.ServiceType Property
 Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). The type of heating or cooling system.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public gbXMLServiceType ServiceType { get; set; }
Public Property ServiceType As gbXMLServiceType
	Get
	Set
public:
property gbXMLServiceType ServiceType {
	gbXMLServiceType get ();
	void set (gbXMLServiceType value);
}
member ServiceType : gbXMLServiceType with get, set
Property Value
gbXMLServiceType
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The service type does not fall within an appropriate range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace